In [79]:
# Import Statements
import pandas as pd
import matplotlib.pyplot as plt

In [81]:
# Create dataframe from csv
global_temp = "Resources/Global_annual_mean_temp.csv"
sea_level = "Resources/sea-levels-news-updated-years.csv"

sea_level_df = pd.read_csv(sea_level)
global_temp_df = pd.read_csv(global_temp)

In [83]:
global_temp_df.head()

   Year  No_Smoothing  Lowess(5)
0  1880         -0.17      -0.10
1  1881         -0.09      -0.13
2  1882         -0.11      -0.17
3  1883         -0.18      -0.20
4  1884         -0.28      -0.24

In [85]:
sea_level_df.head()

,country,Day,Global sea level according to Church and White (2011),Global sea level as an average of Church and White (2011) and UHSLC data
0,World,1880-04-15,-183.31406,-183.31406
1,World,1880-07-15,-183.24739,-183.24739
2,World,1880-10-15,-174.14740,-174.14740
3,World,1881-01-15,-159.68073,-159.68073
4,World,1881-04-15,-172.41406,-172.41406

In [93]:
# Average Year values together to create one single year value per row
sea_level_df["Day"] = pd.to_datetime(sea_level_df["Day"])

sea_level_df["Year"] = sea_level_df["Day"].dt.year

avg_df = sea_level_df.groupby("Year")["Global sea level according to Church and White (2011)"].mean()
avg_df.head(10)

Year
1880   -180.236283
1881   -173.039065
1882   -191.580733
1883   -190.455727
1884   -166.597397
1885   -168.555730
1886   -169.597397
1887   -176.764062
1888   -174.155728
1889   -171.480732
Name: Global sea level according to Church and White (2011), dtype: float64

In [95]:
# Check number of unique year values for global temps
global_temp_df["Year"].unique().size

144

In [97]:
# Check number of unique year values for sea levels
avg_df.unique().size

141

In [99]:
# Check unique year values for sea levels
avg_df.index.unique()

Index([1880, 1881, 1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889,
       ...
       2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020],
      dtype='int32', name='Year', length=141)

In [101]:
# Check unique year values for global temps
global_temp_df["Year"].unique()

array([1880, 1881, 1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890,
       1891, 1892, 1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901,
       1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912,
       1913, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923,
       1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934,
       1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945,
       1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956,
       1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967,
       1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978,
       1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989,
       1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022,
       2023], dtype=int64)

In [107]:
# Merge two df's on Year using inner to remove last 3 years from global temp df
sea_level_temp_df = pd.merge(avg_df, global_temp_df, on="Year", how="inner")

# Check first 5 rows in new df
sea_level_temp_df.head()

,Year,Global sea level according to Church and White (2011),No_Smoothing,Lowess(5)
0,1880,-180.236283,-0.17,-0.10
1,1881,-173.039065,-0.09,-0.13
2,1882,-191.580733,-0.11,-0.17
3,1883,-190.455727,-0.18,-0.20
4,1884,-166.597397,-0.28,-0.24

In [109]:
# Check last 5 rows in new df
sea_level_temp_df.tail()

,Year,Global sea level according to Church and White (2011),No_Smoothing,Lowess(5)
136,2016,56.330711,1.01,0.87
137,2017,55.112391,0.92,0.91
138,2018,52.083274,0.85,0.92
139,2019,60.980738,0.98,0.93
140,2020,65.999739,1.02,0.93